tutorials/dbsBiofilmPimpleFoam/tube/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
  p
    {
      solver           GAMG;
      smoother         DICGaussSeidel;
      tolerance        1e-6;
      relTol           0.01;
    }

  pFinal
    {
      $p;
      relTol          0;
    }

  U
    {
      solver          smoothSolver;
      smoother        symGaussSeidel;
      tolerance       1e-05;
      relTol          0.1;
    }

  UFinal
    {
      $U;
      relTol          0;
    }
  M
    {
      solver          PCG;
      preconditioner  DIC;
      tolerance       1e-6;
      relTol          0;
    }

  C
    {
      solver          PBiCG;
      preconditioner  DILU;
      tolerance       1e-6;
      relTol          0;
    }  
}

PIMPLE
{
  momentumPredictor   no;
  nNonOrthogonalCorrectors 0;
  nCorrectors         2;
  nOuterCorrectors    2;

  pRefCell    0;
  pRefValue    0;
}


// ************************************************************************* //
