tutorials/dbsBiofilmPimpleFoam/tube/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}

actions
(
 {
   name    inoculum;
   type    cellSet;
   action  new;
   source  labelToCell;
   value
     (
      32584
      32429
      32577
      32360
      32580
      32471
      32668
      32310
      32763
      32546
      32463
      32447
      32267
      32732
      32364
      32336
      32433
      32730
      32370
      32565
      32650
      32396
      32326
      32564
      32403
      32543
      32299
      32610
      32721
      32362
      32271
      32531
      32466
      32595
      32746
      32366
      32649
      32741
      32656
      32345
      32421
      32309
      32529
      32748
      32486
      32491
      32350
      32283
      32571
      32744
      32423
      32642
      32540
      32570
      32417
      32348
      32260
      32537
      32454
      32275
      32300
      32664
      32615
      32279
      );
 }
 );
